app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"

  def set_friendship
    @friendship = Friendship.find(params[:id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", "6"]]