app/controllers/musics_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "musics".* FROM "musics"
---
  def index
    # fresh_when @musics
    current_user = User.find(session[:user_id])
    # @musics = current_user.discover_musics.paginate(:page => params[:page], per_page: 5)
    @musics = current_user.discover_musics.includes(:comments, :likes).paginate(:page => params[:page], per_page: 8)

INSERT INTO "musics" ("artist", "comment", "created_at", "hashtag", "link", "title", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @music = Music.new(music_params)

    @music.uid = session[:user_id]

    # create outchain player
    if (@music.sharetype == 0)
      pre = "http://music.163.com/#/song?id="
      @music.link.sub!(pre, "http://music.163.com/outchain/player?type=2&id=")
      @music.link = @music.link + "&auto=0&height=66"
    else
      pre = "http://music.163.com/#/playlist?id="
      @music.link.sub!(pre, "http://music.163.com/outchain/player?type=0&id=")
      @music.link = @music.link + "&auto=0&height=430"
    end

    respond_to do |format|
      if @music.save

UPDATE "musics" SET "comment" = ?, "updated_at" = ? WHERE "musics"."id" = 1  [["comment", "Guys check this out!"], ["updated_at", Fri, 24 Apr 2015 19:46:52 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @music.update(music_params)

DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 14]]
---
  def destroy

    if postComments = Unreadcomment.where(:post_id => @music.id, :commenttype => 0)
      Unreadcomment.delete(postComments)
    end

    if postLikes = Unreadlike.where(:post_id => @music.id, :liketype => 0)
      Unreadlike.delete(postLikes)
    end

    @music.destroy

SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", "14"]]
---
    def set_music
      @music = Music.find(params[:id])