app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users".name ASC
---
  def index
    @users = User.all

SELECT "musics".* FROM "musics" WHERE "musics"."uid" IS NULL ORDER BY id DESC
---
  def show
    @mymusics = Music.where(:uid => params[:id]).order('id DESC')

UPDATE "users" SET "password_digest" = ?, "age" = ?, "interest" = ?, "picurl" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["password_digest", "$2a$10$KcW2M7BIiOlR6wROdTxlP.twRBenHRcCFLISjY.CBPI5SBKT1wEjm"], ["age", "18"], ["interest", ""], ["picurl", ""], ["updated_at", Mon, 27 Apr 2015 19:23:43 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" IN (SELECT friended_id FROM "friendships" WHERE (friender_id = '2'))
---
    def set_user
      @user = User.find(params[:id])