app/controllers/users_controller.rb

SELECT "musics".* FROM "musics" WHERE "musics"."uid" = 6 ORDER BY id DESC
---
  def mytimeline
    @current_user = User.find(session[:user_id])
    @music_collection = Music.where(:uid => params[:id])